/*+===================================================================
	File: FadeManager.hpp
	Summary: （このファイルで何をするか記載する）
	Author: AT13C192 01 青木雄一郎
	Date: 2025/9/12 Fri PM 02:35:53 初回作成
===================================================================+*/
#pragma once

// ==============================
//	include
// ==============================

// ==============================
//	定数定義
// ==============================
namespace
{

}

/// <summary>
/// FadeManagerクラス
/// </summary>
class FadeManager
{
public:
	/// <summary>
	/// コンストラクタ
	/// </summary>
	FadeManager() = default;

	/// <summary>
	/// デストラクタ
	/// </summary>
	~FadeManager() = default;

	// ------------------------------
	//  Getter
	// ------------------------------


	// ------------------------------
	//  Setter
	// ------------------------------

private:

};
