/*+===================================================================
	File: OctreeCell.hpp
	Summary: 8分木の分割された空間ひとつを表すクラス
	Author: AT13C192 01 青木雄一郎
	Date: 2025/12/1 Mon AM 01:17:30 初回作成
===================================================================+*/
#pragma once

// ==============================
//	include
// ==============================

// ==============================
//	定数定義
// ==============================
namespace
{
}

/// <summary>
/// OctreeCellクラス
/// </summary>
template<typename T>
class OctreeCell
{
public:
	OctreeCell() = default;
	~OctreeCell() = default;

	// ------------------------------
	//  Getter
	// ------------------------------


	// ------------------------------
	//  Setter
	// ------------------------------

private:

};
