/*+===================================================================
	File: Component.hpp
	Summary: コンポーネントの基底クラス
	Author: AT13C192 01 青木雄一郎
	Date: 2025/06/16 Mon AM 10:28:25 初回作成
===================================================================+*/
#pragma once

// ==============================
//	include
// ==============================


/// <summary>
/// Componentクラス
/// </summary>
class Component
{
public:
	/// <summary>
	/// コンストラクタ
	/// </summary>
	Component() = default;

	/// <summary>
	/// デストラクタ
	/// </summary>
	~Component() = default;

	// ------------------------------
	//  Getter
	// ------------------------------


	// ------------------------------
	//  Setter
	// ------------------------------

private:

};
