/*+===================================================================
	File: DebugItem.hpp
	Summary: （このファイルで何をするか記載する）
	Author: AT13C192 01 青木雄一郎
	Date: 2025/11/15 Sat PM 04:00:12 初回作成
===================================================================+*/
#pragma once

// ==============================
//	include
// ==============================

// ==============================
//	定数定義
// ==============================
namespace
{

}

/// <summary>
/// DebugItemクラス
/// </summary>
class DebugItem
{
public:
	/// <summary>
	/// コンストラクタ
	/// </summary>
	DebugItem() = default;

	/// <summary>
	/// デストラクタ
	/// </summary>
	~DebugItem() = default;

	// ------------------------------
	//  Getter
	// ------------------------------


	// ------------------------------
	//  Setter
	// ------------------------------

private:

};
