/*+===================================================================
	File: Defines.hpp
	Summary: 共通で使用出来る定義や列挙型、構造体、定数などを定義するヘッダーファイル
	Author: AT13C192 01 青木雄一郎
	Date: 2025/6/22 Sun PM 11:21:46 初回作成
===================================================================+*/
#pragma once

// ==============================
//	include
// ==============================

// C++20以降の機能を利用するための条件付きインクルード
#if __cplusplus >= 202002L
#include <format>
#endif

// ===============================
//  定数
// ===============================
namespace
{
    LPCSTR lpClassName = "DX11Base";				// ウィンドウクラス名
	const std::string AppTitle = "DirectX11_Base";	// アプリケーションタイトル
    constexpr int cx_nWINDOW_WIDTH = 1280;			// ウィンドウ幅
    constexpr int cx_nWINDOW_HEIGHT = 720;			// ウィンドウ高さ
}

// ==============================
//	using宣言
// ==============================
using FilePath = std::string_view;  // ファイルパスを表す型。std::string_viewを使用して、文字列の参照を保持する
using FilePathHold = std::string;   // ファイルパスを表す型。std::stringを使用して、文字列の所有権を持つ(メンバー変数の型に使用)

// ==============================
//  マクロ/関数定義
// ==============================

